Tekla Open API Reference for Tekla Structures 2025
ShapeCatalog Constructor
Overload List
Name | Description
ShapeCatalog()
 Initializes a new instance of the ShapeCatalog class.
ShapeCatalog(String)
 Initializes a new instance of the ShapeCatalog class and will select the Shape (if available) in the tree.
Top
See Also
Reference
ShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace